Repository: 5alafawyyy/Qr-Generator
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: QR Generator
ar: انشاء QR

# enterData
source: Enter data for QR
ar: أدخل بيانات رمز QR

# pickLogo
source: Pick Logo (optional)
ar: اختر شعار (اختياري)

# generateQR
source: Generate QR Code
ar: إنشاء رمز QR

source: Save
ar: حفظ

source: Share
ar: مشاركة

source: History
ar: السجل

# noHistory
source: No QR history yet.
ar: لا يوجد سجل رموز QR بعد.

source: Clear History
ar: مسح السجل

# clearHistoryConfirm
source: Are you sure you want to clear all QR code history?
ar: هل أنت متأكد أنك تريد مسح كل سجل رموز QR؟

source: Cancel
ar: إلغاء

source: Clear
ar: مسح

source: History cleared
ar: تم مسح السجل

source: QR downloaded!
ar: تم تنزيل رمز QR!

# qrSaved
source: QR saved successfully!
ar: تم حفظ رمز QR بنجاح!

source: Invalid QR data.
ar: بيانات QR غير صالحة.

source: Sharing cancelled
ar: تم إلغاء المشاركة

# qrDataCopied
source: QR data copied to clipboard!
ar: تم نسخ بيانات QR إلى الحافظة!

# pleaseGenerateFirst
source: Please generate and save the QR code first.
ar: يرجى إنشاء وحفظ رمز QR أولاً.

# qrFileNotFound
source: QR code file not found.
ar: لم يتم العثور على ملف رمز QR.
